[
  {
    "id": 1,
    "title": "Who ROBBED Mike Bibby? Teammate exposed in podcast!",
    "source": "The OGs Podcast",
    "date": "2024-07-02",
    "preview": "NBA Legends and former teammates Udonis Haslem and Mike Miller welcome Heat legend, Mike Bibby!...",
    "text": "NBA Legends and former teammates Udonis Haslem and Mike Miller welcome Heat legend, Mike Bibby! In the Mike Bibby Podcast, watch the guys talk about Bronny James, getting robbed, untold Miami Heatstories, and much more! This is very juicy and Mike is very specific about the culprit.",
    "imageURL": "/ogs-bibby.png",
    "athlete": "Mike Bibby, Udonis Haslem, Mike Miller",
    "type": "Podcasts",
    "team": "Miami Heat",
    "League": "NBA",
    "likes": "955",
    "comments": "767",
    "link": "[The OGs Podcast with Udonis Haslem and Mike Miller] Mike Bibby Exposes Teammate That Robbed Him | ClutchFanshttps://open.spotify.com/episode/3exiXV65n2vTLuAa5UtTkP?si=70923f77eb8c43da"
  },
  {
    "id": 2,
    "title": "DeRozan CUTS TIES with TORONTO, making cameo in video with Kendrick for DRAKE DISS TRACK!!!Source: Youtube",
    "source": "Youtube",
    "date": "2024-07-05",
    "preview": "They not like us! Demar Derozan has entered the chat…",
    "text": "They not like us! Demar Derozan has entered the chat… and sends message that he is done with the 6ix God Drake and Toronto, where DeRozan led the Toronto Raptors for nine seasons. Six-time All-Star DeMar DeRozan was seen in the music video for Kendrick Lamar’s hit rap single “Not Like Us,” which was released on July 4. DeRozan, who played for the Bulls last season, appeared stoically for about three seconds as Lamar sang the lyrics, “I’m glad DeRoz’ came home, y’all didn’t deserve him neither",
    "imageURL": "/derozan.png",
    "athlete": "Demar DeRozan",
    "type": " beef, music, tea",
    "team": " Lakers, Raptors",
    "League": "NBA",
    "likes": "678",
    "comments": "120",
    "link": "DeMar DeRozan appears in Kendrick Lamar 'Not Like Us' music video (nypost.com)"
  },
  {
    "id": 3,
    "title": "Klay LEAVES the Warriors! Draymond’s emotional reaction on new podcast episode",
    "source": "Youtube",
    "date": "2024-07-03",
    "preview": "Draymond Green discusses the dramatic split of Klay Thompson and the Golden StateWarriors…",
    "text": "Draymond Green discusses the dramatic split of Klay Thompson and the Golden StateWarriors, his conversations with Klay, Steph Curry's posts on Instagram, what this means about the history the trio has had together, why Klay picked the Dallas Mavericks, and more. Then he discusses the rest of NBA free agency including Paul George signing with the Philadelphia 76ers, the Los Angeles Clippers blocking a potential trade to the Dubs, Isaiah Hartenstein signing with the Oklahoma City Thunder, why it was a weird free agency, and more.  Listen to it all in Draymond’s latest podcast",
    "imageURL": "/draymond-klay.png",
    "athlete": "Klay Thompson, Draymond Green",
    "type": "podcast",
    "team": " Warriors",
    "League": "NBA",
    "likes": "324",
    "comments": "305",
    "link": "https://open.spotify.com/episode/3EOpB7c5i5m9GXQ1iEtCZ8?si=0794375917bd4e5c"
  },
  {
    "id": 4,
    "title": "JJ Watt and Austin Rivers SPARRING over whether NBA players could play in NFL",
    "source": "The McAfee Show",
    "date": "2024-05-07",
    "preview": "With his playing career in the rearview, Austin Rivers is still finding his footing as a member of the media…",
    "text": "With his playing career in the rearview, Austin Rivers is still finding his footing as a member of the media. And on Tuesday, the former NBA guard found himself at the center of a social media firestorm after he suggested that 30 NBA players could immediately play in the NFL during a spirited debate with Pat McAfee. “I could take 30 players right now in the NBA and throw them in the NFL,” Rivers said during an appearance on The Pat McAfee Show on Tuesday. “You cannot take 30 NFL players and put them in the NBA.Rivers immediately received pushback from McAfee, a former All-Pro punter and football enthusiast. The two proceeded to go back and forth over whether football or basketball players are the superior athletes, with McAfee noting that only five basketball players have to play at a time, with River rebutting that’s because you guys get a break every play. All you’ve got to do is catch the ball and run north or south. It ain’t complex.Our sport’s better because we would just create a position for one of you 5.2-running 6-foot-10 guys and just put them — can’t get hit much, fragile, McAfee replied. “A little thin, very tall. We would just create a position because we have big brains in our sport. That’s what we would do",
    "imageURL": "/rivers-mcafee.png",
    "athlete": "Austin Rivers",
    "type": "podcast",
    "team": " Rockets",
    "League": "NBA",
    "likes": "541",
    "comments": "632",
    "link": "https://open.spotify.com/episode/0KBPaY8730jJCIAingRiVT?si=4a1a612369fe4fc3"
  },
  {
    "id": 5,
    "title": "LeBron James UNOLLOWED these 3 NBA players on social media",
    "source": "PINKVILLA",
    "date": "2024-06-10",
    "preview": "LeBron James surprised everyone by recently unfollowing three former and current NBA players…",
    "text": "LeBron James surprised everyone by recently unfollowing three former and current NBA players, all basketball legends for no thinkable reason. Kendrick Perkins was the first to be unfollowed after criticizing James for his remarks. The 39-year-old said he missed playing with a teammate of that caliber, and Perkins accused James of trying to steal the Dallas Mavericks player's moment.Ben Simmons and Blake Griffin were the next two to go, though it's still unclear why they did so despite the NBA Alerts report",
    "imageURL": "/lebron-waving.jpg",
    "athlete": "LeBron James",
    "type": "podcast social media, tea",
    "team": " Lakers",
    "League": "NBA",
    "likes": "624",
    "comments": "836",
    "link": " Who are the Three NBA Players That LeBron James Unfollowed on Social Media? Details Inside | PINKVILLA"
  },
  {
    "id": 6,
    "title": "From the COURT TO COUTURE AND THE CATWALK, basketball stars are SCORING BIG in the FASHION world!",
    "source": "CNN",
    "date": "2024-04-29",
    "preview": "Tyrese Haliburton has great style…",
    "text": "Tyrese Haliburton has great style. The 24-year-old pro basketball player — a point guard for the Indiana Pacers — has cultivated a look that’s equal parts academic, retro-militaristic, trendy and preppy. He likes a splash, too. If you look at his Instagram grid, you’ll see such items as a brightly-hued Louis Vuitton Speedy duffel (a piece from Pharrell Williams’ debut menswear collection for the house that retails for nearly $10,000) and an enormous Hermès Birkin, perhaps the ultimate status-symbol bag. Basketball players’ style has more eyes on it than any other sport, the Pulitzer Prize-winning author Mitchell S. Jackson told CNN. How come? “(The league) was the first to embrace it,” Jackson, author of the recently released photobook “Fly: The Big Book of Basketball Fashion,” explained. “Basketball players are so much a part of American culture. Name an athlete in history more famous now than LeBron? More famous in history than Michael Jordan? There was a time when Jordan was the most famous person on earth, and maybe he still is. Throughout “Fly,” Jackson’s bird’s-eye-view on the intersection of high fashion and elite athletes is comprehensive, and packed with commentary and historical context alike. Why, now, does he think this dovetailing is in such a fever pitch? Gilgeous-Alexander — the Oklahoma City Thunder point guard who was voted GQ’s Best Dressed NBA Player in 2022 and 2023 — echoed this sentiment. “The guys before us have paved the way,” he said during All-Star Weekend in mid-February. Gilgeous-Alexander is currently starring in a Converse campaign — he’s a partner of the Nike-owned brand — and describes his own style as, “instinctive, unlimited, and no boundaries.” He concludes: “They laid down the runway for us to benefit. Athletes have had style for so long, we just haven’t had the magnifying glass that exists today.",
    "imageURL": "/nba-fashion.png",
    "athlete": "Tyrese Haliburton",
    "type": "podcast",
    "team": "Indiana Pacers",
    "League": "NBA",
    "likes": "929",
    "comments": "634",
    "link": "  NBA stars are scoring big in the fashion world | CNN"
  },
  {
    "id": 7,
    "title": "The NBA Finals are discussed by LeBron and JJ Redick in podcast",
    "source": "Mind the Game Podcast",
    "date": "2024-06-05",
    "preview": "The NBA Finals are set. Luka Doncic, Kyrie Irving, P.J. Washington and the Dallas Mavericks will face Jayson Tatum…",
    "text": "The NBA Finals are set. Luka Doncic, Kyrie Irving, P.J. Washington and the Dallas Mavericks will face Jayson Tatum, Jaylen Brown, Kristaps Porzingis and the Boston Celtics and JJ Redick and LeBron James are here to break it all down in Episode 9 of Mind the Game Podcast. What advantages do the Mavs and the Celtics have and how can they exploit one another?",
    "imageURL": "/nba-finals-lebron-jj.png",
    "athlete": "LeBron James",
    "type": "podcast",
    "team": "Indiana Pacers",
    "League": "NBA",
    "likes": "715",
    "comments": "634",
    "link": "https://open.spotify.com/episode/5ATAnZKMQPKeE3wQ0LxljZ?si=86959549932c4cf1"
  }
]
